src/Documents/SendAndExportProducts/SendAndExportProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SendAndExportProducts</name>
  <registerRecords>AccumulationRegister.CashFlow</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Staff</name>
    <type>
      <types>CatalogRef.Staffs</types>
    </type>
  </attributes>
  <attributes>
    <name>Total</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Product</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Note</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Inventory/Inventory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Inventory</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Product</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/PaymentMethods/PaymentMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PaymentMethods</name>
  <enumValues>
    <name>Cash</name>
  </enumValues>
  <enumValues>
    <name>BankTransfer</name>
  </enumValues>
</mdclass:Enum>

src/Documents/SendAndExportProducts/Forms/DocumentDetail/Module.bsl
&AtClient
Procedure ProductsProductOnChange(Item)
	// Insert handler content.           
	TabularSectionRow = Items.Products.CurrentData;  
	// Thực hiện đơn vị tính
	TabularSectionRow.Unit = FillUnit(TabularSectionRow.Product);
	// Thực hiện đơn giá 
	TabularSectionRow.Price = FillPriceProduct(TabularSectionRow.Product);
	// Thực hiện số lượng còn lại trong kho
	RemainingQuantity = RemainingQuantityInWarehouse(Object.Date, Object.Warehouse,TabularSectionRow.Product);	
	If RemainingQuantity = "" Then
		 ThisObject.RemainingQuantity = 0;
	Else
		ThisObject.RemainingQuantity = RemainingQuantity;
	EndIf; 
	ThisObject.Product =  TabularSectionRow.Product;
EndProcedure

&AtServer
Function FillUnit ( CurProduct )
	Return CurProduct.Unit;
EndFunction

&AtServer
Function FillPriceProduct(CurProduct)
		Truyvan = New Query;
	
EndFunction

&AtClient
Procedure ProductsQuantityOnChange(Item)
	// Insert handler content.      
	TabularSectionRow = Items.Products.CurrentData;
	CalculateAmount(TabularSectionRow);

EndProcedure

&AtClient
Procedure ProductsPriceOnChange(Item)
	// Insert handler content.
	TabularSectionRow = Items.Products.CurrentData;
	CalculateAmount(TabularSectionRow);

EndProcedure

&AtClient
Procedure CalculateAmount(CurRow)
	CurRow.Amount = CurRow.Quantity * CurRow.Price;
	Object.Total = Object.Products.Total("Amount");
EndProcedure


&AtServer
Procedure PaymentMethodOnChangeAtServer()
	If Object.PaymentMethod = Enums.PaymentMethods.Cash Then
		 ThisObject.CommandBar.ChildItems.FormCreateBasedOn.Visible = False;
	 Else
		ThisObject.CommandBar.ChildItems.FormCreateBasedOn.Visible = True; 
	EndIf
EndProcedure


&AtClient
Procedure PaymentMethodOnChange(Item)
	PaymentMethodOnChangeAtServer();
EndProcedure

&AtServer
Function RemainingQuantityInWarehouse(Date,Warehouse,Product) 
	//{{QUERY_BUILDER_WITH_RESULT_PROCESSING
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	InventoryBalance.Product AS Product,
		|	InventoryBalance.QuantityBalance AS QuantityBalance
		|FROM
		|	AccumulationRegister.Inventory.Balance(&Date, ) AS InventoryBalance
		|WHERE
		|	InventoryBalance.Product = &Product
		|	AND InventoryBalance.Warehouse = &Warehouse";
	
	Query.SetParameter("Product", Product);
	Query.SetParameter("Warehouse", Warehouse);  
	Query.SetParameter("Date", Date);
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do
		Return SelectionDetailRecords.QuantityBalance;
	EndDo;
	
	//}}QUERY_BUILDER_WITH_RESULT_PROCESSING
	
EndFunction

&AtClient
Procedure WarehouseOnChange(Item)
	TabularSectionRow = Items.Products.CurrentData ;
   	If ValueIsFilled(Object.Products) Then
		RemainingQuantity = RemainingQuantityInWarehouse(Object.Date, Object.Warehouse,TabularSectionRow.Product);	
		If RemainingQuantity = "" Then
			 ThisObject.RemainingQuantity = 0;
		Else
			ThisObject.RemainingQuantity = RemainingQuantity;
		EndIf; 
	EndIf;
EndProcedure
